# Вывести первые N чисел кратные M и больше K
N = 5
M = 3
K = -10

i = K
while i < N:
    if i % M == 0:
        print(i)
    i += 1




















