# Вывести первые N чисел кратные M и больше K
N = 3
M = 5
K = 1


i = 0

while i < N:
    if a % 3 == 0 and a > 10:
        print (a)























